---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.ZoneEquipmentData.AirSystemId
source: html/0ce0067f-c37e-0623-b82b-3acdee65177f.htm
---
# Autodesk.Revit.DB.Mechanical.ZoneEquipmentData.AirSystemId Property

The air system used for this zone equipment, if applicable.

## Syntax (C#)
```csharp
public ElementId AirSystemId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null